RT-Thread/rt-thread/bsp/tm4c123bsp/libraries/TivaWare_C_series/tm4c123_driverlib/src/tiva_timer.c
    //
    // Get the interrupt number for this timer module.
    //
    ui32Int = _TimerIntNumberGet(ui32Base, ui32Timer);

    ASSERT(ui32Int != 0);

    //
    // Register the interrupt handler.
    //
    IntRegister(ui32Int, pfnHandler);

    //
    // Enable the interrupt.
    //
    IntEnable(ui32Int);
}

//*****************************************************************************
//
//! Unregisters an interrupt handler for the timer interrupt.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of \b TIMER_A,
//! \b TIMER_B, or \b TIMER_BOTH.
//!
//! This function unregisters the handler to be called when a timer interrupt
//! occurs.  This function also masks off the interrupt in the interrupt
//! controller so that the interrupt handler is no longer called.
//!
//! \sa IntRegister() for important information about registering interrupt
//! handlers.
//!
//! \return None.
//
//*****************************************************************************
void
TimerIntUnregister(uint32_t ui32Base, uint32_t ui32Timer)
{
    uint32_t ui32Int;

    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));
    ASSERT((ui32Timer == TIMER_A) || (ui32Timer == TIMER_B) ||
           (ui32Timer == TIMER_BOTH));

    //
    // Get the interrupt number for this timer module.
    //
    ui32Int = _TimerIntNumberGet(ui32Base, ui32Timer);

    //
    // Disable the interrupt.
    //
    IntDisable(ui32Int);

    //
    // Unregister the interrupt handler.
    //
    IntUnregister(ui32Int);
}

//*****************************************************************************
//
//! Enables individual timer interrupt sources.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be enabled.
//!
//! This function enables the indicated timer interrupt sources.  Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor.
//!
//! The \e ui32IntFlags parameter must be the logical OR of any combination of
//! the following:
//!
//! - \b TIMER_TIMB_DMA - Timer B uDMA complete
//! - \b TIMER_TIMA_DMA - Timer A uDMA complete
//! - \b TIMER_CAPB_EVENT  - Capture B event interrupt
//! - \b TIMER_CAPB_MATCH  - Capture B match interrupt
//! - \b TIMER_TIMB_TIMEOUT  - Timer B timeout interrupt
//! - \b TIMER_RTC_MATCH  - RTC interrupt mask
//! - \b TIMER_CAPA_EVENT  - Capture A event interrupt
//! - \b TIMER_CAPA_MATCH  - Capture A match interrupt
//! - \b TIMER_TIMA_TIMEOUT  - Timer A timeout interrupt
//!
//! \return None.
//
//*****************************************************************************
void
TimerIntEnable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Enable the specified interrupts.
    //
    HWREG(ui32Base + TIMER_O_IMR) |= ui32IntFlags;
}

//*****************************************************************************
//
//! Disables individual timer interrupt sources.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is the bit mask of the interrupt sources to be
//! disabled.
//!
//! This function disables the indicated timer interrupt sources.  Only the
//! sources that are enabled can be reflected to the processor interrupt;
//! disabled sources have no effect on the processor.
//!
//! The \e ui32IntFlags parameter has the same definition as the
//! \e ui32IntFlags parameter to TimerIntEnable().
//!
//! \return None.
//
//*****************************************************************************
void
TimerIntDisable(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Disable the specified interrupts.
    //
    HWREG(ui32Base + TIMER_O_IMR) &= ~(ui32IntFlags);
}

//*****************************************************************************
//
//! Gets the current interrupt status.
//!
//! \param ui32Base is the base address of the timer module.
//! \param bMasked is false if the raw interrupt status is required and true if
//! the masked interrupt status is required.
//!
//! This function returns the interrupt status for the timer module.  Either
//! the raw interrupt status or the status of interrupts that are allowed to
//! reflect to the processor can be returned.
//!
//! \return The current interrupt status, enumerated as a bit field of
//! values described in TimerIntEnable().
//
//*****************************************************************************
uint32_t
TimerIntStatus(uint32_t ui32Base, bool bMasked)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    return(bMasked ? HWREG(ui32Base + TIMER_O_MIS) :
           HWREG(ui32Base + TIMER_O_RIS));
}

//*****************************************************************************
//
//! Clears timer interrupt sources.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32IntFlags is a bit mask of the interrupt sources to be cleared.
//!
//! The specified timer interrupt sources are cleared, so that they no longer
//! assert.  This function must be called in the interrupt handler to keep the
//! interrupt from being triggered again immediately upon exit.
//!
//! The \e ui32IntFlags parameter has the same definition as the
//! \e ui32IntFlags parameter to TimerIntEnable().
//!
//! \note Because there is a write buffer in the Cortex-M processor, it may
//! take several clock cycles before the interrupt source is actually cleared.
//! Therefore, it is recommended that the interrupt source be cleared early in
//! the interrupt handler (as opposed to the very last action) to avoid
//! returning from the interrupt handler before the interrupt source is
//! actually cleared.  Failure to do so may result in the interrupt handler
//! being immediately reentered (because the interrupt controller still sees
//! the interrupt source asserted).
//!
//! \return None.
//
//*****************************************************************************
void
TimerIntClear(uint32_t ui32Base, uint32_t ui32IntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Clear the requested interrupt sources.
    //
    HWREG(ui32Base + TIMER_O_ICR) = ui32IntFlags;
}

//*****************************************************************************
//
//! Synchronizes the counters in a set of timers.
//!
//! \param ui32Base is the base address of the timer module.  This parameter
//! must be the base address of Timer0 (in other words, \b TIMER0_BASE).
//! \param ui32Timers is the set of timers to synchronize.
//!
//! This function synchronizes the counters in a specified set of timers.
//! When a timer is running in half-width mode, each half can be included or
//! excluded in the synchronization event.  When a timer is running in
//! full-width mode, only the A timer can be synchronized (specifying the B
//! timer has no effect).
//!
//! The \e ui32Timers parameter is the logical OR of any of the following
//! defines:
//!
//! - \b TIMER_0A_SYNC
//! - \b TIMER_0B_SYNC
//! - \b TIMER_1A_SYNC
//! - \b TIMER_1B_SYNC
//! - \b TIMER_2A_SYNC
//! - \b TIMER_2B_SYNC
//! - \b TIMER_3A_SYNC
//! - \b TIMER_3B_SYNC
//! - \b TIMER_4A_SYNC
//! - \b TIMER_4B_SYNC
//! - \b TIMER_5A_SYNC
//! - \b TIMER_5B_SYNC
//! - \b WTIMER_0A_SYNC
//! - \b WTIMER_0B_SYNC
//! - \b WTIMER_1A_SYNC
//! - \b WTIMER_1B_SYNC
//! - \b WTIMER_2A_SYNC
//! - \b WTIMER_2B_SYNC
//! - \b WTIMER_3A_SYNC
//! - \b WTIMER_3B_SYNC
//! - \b WTIMER_4A_SYNC
//! - \b WTIMER_4B_SYNC
//! - \b WTIMER_5A_SYNC
//! - \b WTIMER_5B_SYNC
//!
//! \note This functionality is not available on all parts.
//!
//! \return None.
//
//*****************************************************************************
void
TimerSynchronize(uint32_t ui32Base, uint32_t ui32Timers)
{
    //
    // Check the arguments.
    //
    ASSERT(ui32Base == TIMER0_BASE);

    //
    // Synchronize the specified timers.
    //
    HWREG(ui32Base + TIMER_O_SYNC) = ui32Timers;
}

//*****************************************************************************
//
//! Enables the events that can cause an ADC trigger event.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32ADCEvent is a bit mask of the events that can cause an ADC
//!        trigger event.
//!
//! This function enables the timer events that can cause an ADC trigger event.
//! The ADC trigger events are specified in the \e ui32ADCEvent parameter by
//! passing in the logical OR of any of the following values:
//!
//! - \b TIMER_ADC_MODEMATCH_B - Enables the mode match ADC trigger for timer
//!   B.
//! - \b TIMER_ADC_CAPEVENT_B - Enables the capture event ADC trigger for
//!   timer B.
//! - \b TIMER_ADC_CAPMATCH_B - Enables the capture match ADC trigger for
//!   timer B.
//! - \b TIMER_ADC_TIMEOUT_B - Enables the timeout ADC trigger for timer B.
//! - \b TIMER_ADC_MODEMATCH_A - Enables the mode match ADC trigger for timer
//!   A.
//! - \b TIMER_ADC_RTC_A - Enables the RTC ADC trigger for timer A.
//! - \b TIMER_ADC_CAPEVENT_A - Enables the capture event ADC trigger for
//!   timer A.
//! - \b TIMER_ADC_CAPMATCH_A - Enables the capture match ADC trigger for
//!   timer A.
//! - \b TIMER_ADC_TIMEOUT_A - Enables the timeout ADC trigger for timer A.
//!
//! \note The ability to specify ADC event triggers varies with the Tiva
//! part in use.  Please consult the data sheet for the part you are
//! using to determine whether this support is available.
//!
//! \return None.
//
//*****************************************************************************
void
TimerADCEventSet(uint32_t ui32Base, uint32_t ui32ADCEvent)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Set the ADC triggers.
    //
    HWREG(ui32Base + TIMER_O_ADCEV) = ui32ADCEvent;
}

//*****************************************************************************
//
//! Returns the events that can cause an ADC trigger event.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! This function returns the timer events that can cause an ADC trigger event.
//! The ADC trigger events are the logical OR of any of the following values:
//!
//! - \b TIMER_ADC_MODEMATCH_B - The mode match ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_CAPEVENT_B - The capture event ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_CAPMATCH_B - The capture match ADC trigger for timer B is
//!   enabled.
//! - \b TIMER_ADC_TIMEOUT_B - The timeout ADC trigger for timer B is enabled.
//! - \b TIMER_ADC_MODEMATCH_A - The mode match ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_RTC_A - The RTC ADC trigger for timer A is enabled.
//! - \b TIMER_ADC_CAPEVENT_A - The capture event ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_CAPMATCH_A - The capture match ADC trigger for timer A is
//!   enabled.
//! - \b TIMER_ADC_TIMEOUT_A - The timeout ADC trigger for timer A is enabled.
//!
//! \note The ability to specify ADC event triggers varies with the Tiva
//! part in use.  Please consult the data sheet for the part you are
//! using to determine whether this support is available.
//!
//! \return The timer events that trigger the ADC.
//
//*****************************************************************************
uint32_t
TimerADCEventGet(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Return the current ADC triggers.
    //
    return(HWREG(ui32Base + TIMER_O_ADCEV));
}

//*****************************************************************************
//
//! Enables the events that can trigger a uDMA request.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32DMAEvent is a bit mask of the events that can trigger uDMA.
//!
//! This function enables the timer events that can trigger the start of a uDMA
//! sequence.  The uDMA trigger events are specified in the \e ui32DMAEvent
//! parameter by passing in the logical OR of the following values:
//!
//! - \b TIMER_DMA_MODEMATCH_B - The mode match uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_CAPEVENT_B - The capture event uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_CAPMATCH_B - The capture match uDMA trigger for timer B is
//!   enabled.
//! - \b TIMER_DMA_TIMEOUT_B - The timeout uDMA trigger for timer B is enabled.
//! - \b TIMER_DMA_MODEMATCH_A - The mode match uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_RTC_A - The RTC uDMA trigger for timer A is enabled.
//! - \b TIMER_DMA_CAPEVENT_A - The capture event uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_CAPMATCH_A - The capture match uDMA trigger for timer A is
//!   enabled.
//! - \b TIMER_DMA_TIMEOUT_A - The timeout uDMA trigger for timer A is enabled.
//!
//! \note The ability to specify uDMA event triggers varies with the Tiva
//! part in use.  Please consult the data sheet for the part you are
//! using to determine whether this support is available.
//!
//! \return None.
//
//*****************************************************************************
void
TimerDMAEventSet(uint32_t ui32Base, uint32_t ui32DMAEvent)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Set the uDMA triggers.
    //
    HWREG(ui32Base + TIMER_O_DMAEV) = ui32DMAEvent;
}

//*****************************************************************************
//
//! Returns the events that can trigger a uDMA request.
//!
//! \param ui32Base is the base address of the timer module.
//!
//! This function returns the timer events that can trigger the start of a uDMA
//! sequence.  The uDMA trigger events are the logical OR of the following
//! values:
//!
//! - \b TIMER_DMA_MODEMATCH_B - Enables the mode match uDMA trigger for timer
//!   B.
//! - \b TIMER_DMA_CAPEVENT_B - Enables the capture event uDMA trigger for
//!   timer B.
//! - \b TIMER_DMA_CAPMATCH_B - Enables the capture match uDMA trigger for
//!   timer B.
//! - \b TIMER_DMA_TIMEOUT_B - Enables the timeout uDMA trigger for timer B.
//! - \b TIMER_DMA_MODEMATCH_A - Enables the mode match uDMA trigger for timer
//!   A.
//! - \b TIMER_DMA_RTC_A - Enables the RTC uDMA trigger for timer A.
//! - \b TIMER_DMA_CAPEVENT_A - Enables the capture event uDMA trigger for
//!   timer A.
//! - \b TIMER_DMA_CAPMATCH_A - Enables the capture match uDMA trigger for
//!   timer A.
//! - \b TIMER_DMA_TIMEOUT_A - Enables the timeout uDMA trigger for timer A.
//!
//! \note The ability to specify uDMA event triggers varies with the Tiva
//! part in use.  Please consult the data sheet for the part you are
//! using to determine whether this support is available.
//!
//! \return The timer events that trigger the uDMA.
//
//*****************************************************************************
uint32_t
TimerDMAEventGet(uint32_t ui32Base)
{
    //
    // Check the arguments.
    //
    ASSERT(_TimerBaseValid(ui32Base));

    //
    // Return the current uDMA triggers.
    //
    return(HWREG(ui32Base + TIMER_O_DMAEV));
}

//*****************************************************************************
//
//! This function configures the update of timer load and match settings.
//!
//! \param ui32Base is the base address of the timer module.
//! \param ui32Timer specifies the timer(s); must be one of \b TIMER_A,
//! \b TIMER_B, or \b TIMER_BOTH.
//! \param ui32Config is a combination of the updates methods for the timers
//! specified in the \e ui32Timer parameter.
//!
//! This function configures how the timer updates the timer load and match
//! values for the timers.  The \e ui32Timer values can be \b TIMER_A,
//! \b TIMER_B, or \b TIMER_BOTH to apply the settings in \e ui32Config to
//! either timer or both timers.  If the timer is not split then the \b TIMER_A
//! should be used.  The \e ui32Config values affects when the TimerLoadSet()
//! and TimerLoadSet64() values take effect.
//!
//! - \b TIMER_UP_LOAD_IMMEDIATE is the default mode that causes the
//! TimerLoadSet() or TimerLoadSet64() to update the timer counter immediately.
//! - \b TIMER_UP_LOAD_TIMEOUT causes the TimerLoadSet() or TimerLoadSet64() to
//! update the timer when it counts down to zero.
//!
//! Similarly the \e ui32Config value affects when the TimerMatchSet() and
//! TimerMatchSet64() values take effect.
//!
//! - \b TIMER_UP_MATCH_IMMEDIATE is the default mode that causes the
//! TimerMatchSet() or TimerMatchSet64() to update the timer match value
//! immediately.
//! - \b TIMER_UP_MATCH_TIMEOUT causes the TimerMatchSet() or TimerMatchSet64()
//! to update the timer match value when it counts down to zero.
//!
//! \note These settings have no effect if the timer is not in count down mode
//! and are mostly useful when operating in PWM mode to allow for synchronous
//! update of timer match and load values.
//!
//! \return None.
//
//*****************************************************************************
void
TimerUpdateMode(uint32_t ui32Base, uint32_t ui32Timer, uint32_t ui32Config)
{
    uint32_t ui32Value;

    if((ui32Timer & TIMER_A) == TIMER_A)
    {
        ui32Value = HWREG(ui32Base + TIMER_O_TAMR) & ~(0x00000500);
        ui32Value |= ui32Config;
        HWREG(ui32Base + TIMER_O_TAMR) = ui32Value;
    }

    if((ui32Timer & TIMER_B) == TIMER_B)
    {
        ui32Value = HWREG(ui32Base + TIMER_O_TBMR) & ~(0x00000500);
        ui32Value |= ui32Config;
        HWREG(ui32Base + TIMER_O_TBMR) = ui32Value;
    }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
